; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v13 ?v3)
             (pred_6 ?v12 ?v2)
             (pred_2 ?v13 ?v2)
             (pred_10 ?v7 ?v13 )
	     (pred_3 ?v13)
             (pred_5 ?v6)
             (pred_9 ?v12)
             (pred_7 ?v2)
             (pred_1 ?v13)
             (pred_4 ?v12)
             (pred_8 ?v13)
             (pred_12 ))



(:action op_2
:parameters (?v4 ?v10 ?v9 ?v1)
:precondition (and (pred_5 ?v4) (pred_5 ?v10) (pred_9 ?v9) (pred_7 ?v1)
          (pred_11 ?v4 ?v10) (pred_6 ?v9 ?v1)
                   (pred_2 ?v10 ?v1) (pred_3 ?v4) 
                   (pred_1 ?v10) (pred_4 ?v9))
:effect (and  (pred_8 ?v10) (not (pred_1 ?v10))))


(:action op_5
:parameters (?v4 ?v11)
:precondition (and (pred_5 ?v4) (pred_5 ?v11)
               (pred_3 ?v4) (pred_11 ?v4 ?v11) (pred_8 ?v11))
:effect (and (pred_3 ?v11) (not (pred_3 ?v4))))

(:action op_3
:parameters (?v4 ?v9)
:precondition (and (pred_5 ?v4) (pred_9 ?v9) 
                  (pred_3 ?v4) (pred_10 ?v9 ?v4) (pred_12 ))
:effect (and (pred_4 ?v9)
   (not (pred_10 ?v9 ?v4)) (not (pred_12 ))))


(:action op_1
:parameters (?v4 ?v8 ?v5)
:precondition (and (pred_5 ?v4) (pred_9 ?v8) (pred_9 ?v5)
                  (pred_3 ?v4) (pred_4 ?v5) (pred_10 ?v8 ?v4))
:effect (and (pred_4 ?v8) (pred_10 ?v5 ?v4)
        (not (pred_4 ?v5)) (not (pred_10 ?v8 ?v4))))

(:action op_4
:parameters (?v4 ?v9)
:precondition (and (pred_5 ?v4) (pred_9 ?v9) 
                  (pred_3 ?v4) (pred_4 ?v9))
:effect (and (pred_12 ) (pred_10 ?v9 ?v4) (not (pred_4 ?v9)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_07 obj_23 obj_02 obj_25 obj_19 obj_18 obj_14 obj_22 obj_20 obj_15 obj_04 obj_13 obj_26 obj_11 obj_12 obj_01 obj_28 obj_09 obj_16 obj_27 obj_08 obj_06 obj_24 obj_10 obj_03
    obj_17 obj_21
    obj_29 obj_30 obj_05
    )

    (:init
       (pred_12)

       (pred_5 obj_07)
       (pred_5 obj_23)
       (pred_5 obj_02)
       (pred_5 obj_25)
       (pred_5 obj_19)
       (pred_5 obj_18)
       (pred_5 obj_14)
       (pred_5 obj_22)
       (pred_5 obj_20)
       (pred_5 obj_15)
       (pred_5 obj_04)
       (pred_5 obj_13)
       (pred_5 obj_26)
       (pred_5 obj_11)
       (pred_5 obj_12)
       (pred_5 obj_01)
       (pred_5 obj_28)
       (pred_5 obj_09)
       (pred_5 obj_16)
       (pred_5 obj_27)
       (pred_5 obj_08)
       (pred_5 obj_06)
       (pred_5 obj_24)
       (pred_5 obj_10)
       (pred_5 obj_03)
       (pred_7 obj_17)
       (pred_7 obj_21)
       (pred_9 obj_29)
       (pred_9 obj_30)
       (pred_9 obj_05)

       (pred_11 obj_07 obj_18)
       (pred_11 obj_07 obj_23)
       (pred_11 obj_23 obj_14)
       (pred_11 obj_23 obj_02)
       (pred_11 obj_23 obj_07)
       (pred_11 obj_02 obj_22)
       (pred_11 obj_02 obj_25)
       (pred_11 obj_02 obj_23)
       (pred_11 obj_25 obj_20)
       (pred_11 obj_25 obj_19)
       (pred_11 obj_25 obj_02)
       (pred_11 obj_19 obj_15)
       (pred_11 obj_19 obj_25)
       (pred_11 obj_18 obj_04)
       (pred_11 obj_18 obj_14)
       (pred_11 obj_18 obj_07)
       (pred_11 obj_14 obj_13)
       (pred_11 obj_14 obj_22)
       (pred_11 obj_14 obj_23)
       (pred_11 obj_14 obj_18)
       (pred_11 obj_22 obj_26)
       (pred_11 obj_22 obj_20)
       (pred_11 obj_22 obj_02)
       (pred_11 obj_22 obj_14)
       (pred_11 obj_20 obj_11)
       (pred_11 obj_20 obj_15)
       (pred_11 obj_20 obj_25)
       (pred_11 obj_20 obj_22)
       (pred_11 obj_15 obj_12)
       (pred_11 obj_15 obj_19)
       (pred_11 obj_15 obj_20)
       (pred_11 obj_04 obj_01)
       (pred_11 obj_04 obj_13)
       (pred_11 obj_04 obj_18)
       (pred_11 obj_13 obj_28)
       (pred_11 obj_13 obj_26)
       (pred_11 obj_13 obj_14)
       (pred_11 obj_13 obj_04)
       (pred_11 obj_26 obj_09)
       (pred_11 obj_26 obj_11)
       (pred_11 obj_26 obj_22)
       (pred_11 obj_26 obj_13)
       (pred_11 obj_11 obj_16)
       (pred_11 obj_11 obj_12)
       (pred_11 obj_11 obj_20)
       (pred_11 obj_11 obj_26)
       (pred_11 obj_12 obj_27)
       (pred_11 obj_12 obj_15)
       (pred_11 obj_12 obj_11)
       (pred_11 obj_01 obj_08)
       (pred_11 obj_01 obj_28)
       (pred_11 obj_01 obj_04)
       (pred_11 obj_28 obj_06)
       (pred_11 obj_28 obj_09)
       (pred_11 obj_28 obj_13)
       (pred_11 obj_28 obj_01)
       (pred_11 obj_09 obj_24)
       (pred_11 obj_09 obj_16)
       (pred_11 obj_09 obj_26)
       (pred_11 obj_09 obj_28)
       (pred_11 obj_16 obj_10)
       (pred_11 obj_16 obj_27)
       (pred_11 obj_16 obj_11)
       (pred_11 obj_16 obj_09)
       (pred_11 obj_27 obj_03)
       (pred_11 obj_27 obj_12)
       (pred_11 obj_27 obj_16)
       (pred_11 obj_08 obj_06)
       (pred_11 obj_08 obj_01)
       (pred_11 obj_06 obj_24)
       (pred_11 obj_06 obj_28)
       (pred_11 obj_06 obj_08)
       (pred_11 obj_24 obj_10)
       (pred_11 obj_24 obj_09)
       (pred_11 obj_24 obj_06)
       (pred_11 obj_10 obj_03)
       (pred_11 obj_10 obj_16)
       (pred_11 obj_10 obj_24)
       (pred_11 obj_03 obj_27)
       (pred_11 obj_03 obj_10)
       (pred_1 obj_14)
       (pred_1 obj_16)
       (pred_1 obj_06)
       (pred_2  obj_14 obj_17)
       (pred_2  obj_16 obj_21)
       (pred_2  obj_06 obj_21)
       (pred_8 obj_07)
       (pred_8 obj_23)
       (pred_8 obj_02)
       (pred_8 obj_25)
       (pred_8 obj_19)
       (pred_8 obj_18)
       (pred_8 obj_22)
       (pred_8 obj_20)
       (pred_8 obj_15)
       (pred_8 obj_04)
       (pred_8 obj_13)
       (pred_8 obj_26)
       (pred_8 obj_11)
       (pred_8 obj_12)
       (pred_8 obj_01)
       (pred_8 obj_28)
       (pred_8 obj_09)
       (pred_8 obj_27)
       (pred_8 obj_08)
       (pred_8 obj_24)
       (pred_8 obj_10)
       (pred_8 obj_03)

       (pred_6  obj_29 obj_17)
       (pred_6  obj_30 obj_21)
       (pred_6  obj_05 obj_21)
       (pred_10 obj_29 obj_20)
       (pred_10 obj_30 obj_19)
       (pred_10 obj_05 obj_23)
       (pred_3 obj_25)
    )

    (:goal (and
       (pred_10 obj_29 obj_10)
    ))
(:constraints
  (always (not (pred_3 obj_09)))
)
)

; plan
1. (op_5 obj_25 obj_20)
   deleted: (pred_3 obj_25)
   added: (pred_3 obj_20)
   goals met: 0 of 1
2. (op_3 obj_20 obj_29)
   deleted: (pred_10 obj_29 obj_20) (pred_12)
   added: (pred_4 obj_29)
   goals met: 0 of 1
3. (op_5 obj_20 obj_15)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_15)
   goals met: 0 of 1
4. (op_5 obj_15 obj_12)
   deleted: (pred_3 obj_15)
   added: (pred_3 obj_12)
   goals met: 0 of 1
5. (op_5 obj_12 obj_27)
   deleted: (pred_3 obj_12)
   added: (pred_3 obj_27)
   goals met: 0 of 1
6. (op_5 obj_27 obj_03)
   deleted: (pred_3 obj_27)
   added: (pred_3 obj_03)
   goals met: 0 of 1
7. (op_5 obj_03 obj_10)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_10)
   goals met: 0 of 1
8. (op_4 obj_10 obj_29)
   deleted: (pred_4 obj_29)
   added: (pred_12) (pred_10 obj_29 obj_10)
   goals met: 1 of 1
